itzandroidtab/klib-svd/lpc1752.svd
                <register>
                    <name>LSR</name>
                    <description>Line Status Register. Contains flags for transmit and receive
                        status, including line errors.</description>
                    <addressOffset>0x014</addressOffset>
                    <access>read-only</access>
                    <resetValue>0x60</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <readAction>modify</readAction>
                    <fields>
                        <field>
                            <name>RDR</name>
                            <description>Receiver Data Ready. LSR[0] is set when the RBR holds an
                                unread character and is cleared when the UART1 RBR FIFO is empty.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>The UART1 receiver FIFO is empty.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NOTEMPTY</name>
                                    <description>The UART1 receiver FIFO is not empty.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OE</name>
                            <description>Overrun Error. The overrun error condition is set as soon
                                as it occurs. An LSR read clears LSR[1]. LSR[1] is set when UART1
                                RSR has a new character assembled and the UART1 RBR FIFO is full. In
                                this case, the UART1 RBR FIFO will not be overwritten and the
                                character in the UART1 RSR will be lost.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <description>Overrun error status is inactive.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <description>Overrun error status is active.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PE</name>
                            <description>Parity Error. When the parity bit of a received character
                                is in the wrong state, a parity error occurs. An LSR read clears
                                LSR[2]. Time of parity error detection is dependent on FCR[0]. Note:
                                A parity error is associated with the character at the top of the
                                UART1 RBR FIFO.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <description>Parity error status is inactive.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <description>Parity error status is active.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FE</name>
                            <description>Framing Error. When the stop bit of a received character is
                                a logic 0, a framing error occurs. An LSR read clears LSR[3]. The
                                time of the framing error detection is dependent on FCR0. Upon
                                detection of a framing error, the RX will attempt to resynchronize
                                to the data and assume that the bad stop bit is actually an early
                                start bit. However, it cannot be assumed that the next received byte
                                will be correct even if there is no Framing Error. Note: A framing
                                error is associated with the character at the top of the UART1 RBR
                                FIFO.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <description>Framing error status is inactive.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <description>Framing error status is active.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BI</name>
                            <description>Break Interrupt. When RXD1 is held in the spacing state
                                (all zeroes) for one full character transmission (start, data,
                                parity, stop), a break interrupt occurs. Once the break condition
                                has been detected, the receiver goes idle until RXD1 goes to marking
                                state (all ones). An LSR read clears this status bit. The time of
                                break detection is dependent on FCR[0]. Note: The break interrupt is
                                associated with the character at the top of the UART1 RBR FIFO.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <description>Break interrupt status is inactive.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <description>Break interrupt status is active.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>THRE</name>
                            <description>Transmitter Holding Register Empty. THRE is set immediately
                                upon detection of an empty UART1 THR and is cleared on a THR write.</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>VALID</name>
                                    <description>THR contains valid data.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THR_IS_EMPTY_</name>
                                    <description>THR is empty.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TEMT</name>
                            <description>Transmitter Empty. TEMT is set when both THR and TSR are
                                empty; TEMT is cleared when either the TSR or the THR contain valid
                                data.</description>
                            <bitRange>[6:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>VALID</name>
                                    <description>THR and/or the TSR contains valid data.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>THR and the TSR are empty.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXFE</name>
                            <description>Error in RX FIFO. LSR[7] is set when a character with a RX
                                error such as framing error, parity error or break interrupt, is
                                loaded into the RBR. This bit is cleared when the LSR register is
                                read and there are no subsequent errors in the UART1 FIFO.</description>
                            <bitRange>[7:7]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NOERROR</name>
                                    <description>RBR contains no UART1 RX errors or FCR[0]=0.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ERRORS</name>
                                    <description>UART1 RBR contains at least one UART1 RX error.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSR</name>
                    <description>Modem Status Register. Contains handshake signal status flags.</description>
                    <addressOffset>0x018</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <readAction>modify</readAction>
                    <fields>
                        <field>
                            <name>DCTS</name>
                            <description>Delta CTS. Set upon state change of input CTS. Cleared on
                                an MSR read.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_CHANGE_DETECTED_O</name>
                                    <description>No change detected on modem input, CTS.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATE_CHANGE_DETECTE</name>
                                    <description>State change detected on modem input, CTS.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DDSR</name>
                            <description>Delta DSR. Set upon state change of input DSR. Cleared on
                                an MSR read.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_CHANGE_DETECTED_O</name>
                                    <description>No change detected on modem input, DSR.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATE_CHANGE_DETECTE</name>
                                    <description>State change detected on modem input, DSR.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TERI</name>
                            <description>Trailing Edge RI. Set upon low to high transition of input
                                RI. Cleared on an MSR read.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_CHANGE_DETECTED_O</name>
                                    <description>No change detected on modem input, RI.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOW_TO_HIGH_TRANSITI</name>
                                    <description>Low-to-high transition detected on RI.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DDCD</name>
                            <description>Delta DCD. Set upon state change of input DCD. Cleared on
                                an MSR read.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_CHANGE_DETECTED_O</name>
                                    <description>No change detected on modem input, DCD.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATE_CHANGE_DETECTE</name>
                                    <description>State change detected on modem input, DCD.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTS</name>
                            <description>Clear To Send State. Complement of input signal CTS. This
                                bit is connected to MCR[1] in modem loopback mode.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>DSR</name>
                            <description>Data Set Ready State. Complement of input signal DSR. This
                                bit is connected to MCR[0] in modem loopback mode.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RI</name>
                            <description>Ring Indicator State. Complement of input RI. This bit is
                                connected to MCR[2] in modem loopback mode.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>DCD</name>
                            <description>Data Carrier Detect State. Complement of input DCD. This
                                bit is connected to MCR[3] in modem loopback mode.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCR</name>
                    <description>Scratch Pad Register. 8-bit temporary storage for software.</description>
                    <addressOffset>0x01C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Pad</name>
                            <description>A readable, writable byte.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
