itzandroidtab/klib-svd/lpc1752.svd
                    <register>
                        <name>STATF</name>
                        <description>GPIO Interrupt Status for Falling edge for Port 0.</description>
                        <addressOffset>0x004</addressOffset>
                        <access>read-only</access>
                        <resetValue>0</resetValue>
                        <resetMask>0xFFFFFFFF</resetMask>
                        <fields>
                            <field>
                                <name>P_0FEI</name>
                                <description>Status of Falling Edge Interrupt for P[0]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>P_1FEI</name>
                                <description>Status of Falling Edge Interrupt for P[1]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <field>
                                <name>P_2FEI</name>
                                <description>Status of Falling Edge Interrupt for P[2]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[2:2]</bitRange>
                            </field>
                            <field>
                                <name>P_3FEI</name>
                                <description>Status of Falling Edge Interrupt for P[3]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[3:3]</bitRange>
                            </field>
                            <field>
                                <name>P_4FEI</name>
                                <description>Status of Falling Edge Interrupt for P[4]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>P_5FEI</name>
                                <description>Status of Falling Edge Interrupt for P[5]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                            <field>
                                <name>P_6FEI</name>
                                <description>Status of Falling Edge Interrupt for P[6]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[6:6]</bitRange>
                            </field>
                            <field>
                                <name>P_7FEI</name>
                                <description>Status of Falling Edge Interrupt for P[7]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[7:7]</bitRange>
                            </field>
                            <field>
                                <name>P_8FEI</name>
                                <description>Status of Falling Edge Interrupt for P[8]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[8:8]</bitRange>
                            </field>
                            <field>
                                <name>P_9FEI</name>
                                <description>Status of Falling Edge Interrupt for P[9]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[9:9]</bitRange>
                            </field>
                            <field>
                                <name>P_10FEI</name>
                                <description>Status of Falling Edge Interrupt for P[10]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[10:10]</bitRange>
                            </field>
                            <field>
                                <name>P_11FEI</name>
                                <description>Status of Falling Edge Interrupt for P[11]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[11:11]</bitRange>
                            </field>
                            <field>
                                <name>P_12FEI</name>
                                <description>Status of Falling Edge Interrupt for P[12]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[12:12]</bitRange>
                            </field>
                            <field>
                                <name>P_13FEI</name>
                                <description>Status of Falling Edge Interrupt for P[13]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[13:13]</bitRange>
                            </field>
                            <field>
                                <name>P_14FEI</name>
                                <description>Status of Falling Edge Interrupt for P[14]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[14:14]</bitRange>
                            </field>
                            <field>
                                <name>P_15FEI</name>
                                <description>Status of Falling Edge Interrupt for P[15]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[15:15]</bitRange>
                            </field>
                            <field>
                                <name>P_16FEI</name>
                                <description>Status of Falling Edge Interrupt for P[16]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[16:16]</bitRange>
                            </field>
                            <field>
                                <name>P_17FEI</name>
                                <description>Status of Falling Edge Interrupt for P[17]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[17:17]</bitRange>
                            </field>
                            <field>
                                <name>P_18FEI</name>
                                <description>Status of Falling Edge Interrupt for P[18]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[18:18]</bitRange>
                            </field>
                            <field>
                                <name>P_19FEI</name>
                                <description>Status of Falling Edge Interrupt for P[19]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[19:19]</bitRange>
                            </field>
                            <field>
                                <name>P_20FEI</name>
                                <description>Status of Falling Edge Interrupt for P[20]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[20:20]</bitRange>
                            </field>
                            <field>
                                <name>P_21FEI</name>
                                <description>Status of Falling Edge Interrupt for P[21]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[21:21]</bitRange>
                            </field>
                            <field>
                                <name>P_22FEI</name>
                                <description>Status of Falling Edge Interrupt for P[22]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[22:22]</bitRange>
                            </field>
                            <field>
                                <name>P_23FEI</name>
                                <description>Status of Falling Edge Interrupt for P[23]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[23:23]</bitRange>
                            </field>
                            <field>
                                <name>P_24FEI</name>
                                <description>Status of Falling Edge Interrupt for P[24]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[24:24]</bitRange>
                            </field>
                            <field>
                                <name>P_25FEI</name>
                                <description>Status of Falling Edge Interrupt for P[25]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[25:25]</bitRange>
                            </field>
                            <field>
                                <name>P_26FEI</name>
                                <description>Status of Falling Edge Interrupt for P[26]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[26:26]</bitRange>
                            </field>
                            <field>
                                <name>P_27FEI</name>
                                <description>Status of Falling Edge Interrupt for P[27]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[27:27]</bitRange>
                            </field>
                            <field>
                                <name>P_28FEI</name>
                                <description>Status of Falling Edge Interrupt for P[28]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[28:28]</bitRange>
                            </field>
                            <field>
                                <name>P_29FEI</name>
                                <description>Status of Falling Edge Interrupt for P[29]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[29:29]</bitRange>
                            </field>
                            <field>
                                <name>P_30FEI</name>
                                <description>Status of Falling Edge Interrupt for P[30]. 0 = No
                                    falling
                                    edge detected. 1 = Falling edge interrupt generated.</description>
                                <bitRange>[30:30]</bitRange>
                            </field>
                            <field>
                                <name>RESERVED</name>
                                <description>Reserved.</description>
                                <bitRange>[31:31]</bitRange>
                            </field>
                        </fields>
                    </register>
