itzandroidtab/klib-svd/lpc1752.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PINCONNECT</name>
            <description>Pin connect block</description>
            <baseAddress>0x4002C000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>11</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-11</dimIndex>
                    <name>PINSEL[%s]</name>
                    <displayName>PINSEL[%s]</displayName>
                    <description>Pin function select register %s.</description>
                    <addressOffset>0x0</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields></fields>
                </register>
                <register>
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-10</dimIndex>
                    <name>PINMODE[%s]</name>
                    <displayName>PINMODE[%s]</displayName>
                    <description>Pin mode select register %s.</description>
                    <addressOffset>0x040</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields></fields>
                </register>
                <register>
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>PINMODE_OD[%s]</name>
                    <displayName>PINMODE_OD[%s]</displayName>
                    <description>Open drain mode control register %s.</description>
                    <addressOffset>0x068</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields></fields>
                </register>
                <register>
                    <name>I2CPADCFG</name>
                    <description>I2C Pin Configuration register</description>
                    <addressOffset>0x07C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SDADRV0</name>
                            <description>Drive mode control for the SDA0 pin, P0.27.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>STANDARD</name>
                                    <description>Standard. The SDA0 pin is in the standard drive
                                        mode.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FAST_MODE_PLUS</name>
                                    <description>Fast-mode plus. The SDA0 pin is in Fast Mode Plus
                                        drive mode.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SDAI2C0</name>
                            <description>I 2C filter mode control for the SDA0 pin, P0.27.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <description>Enabled. The SDA0 pin has I2C glitch filtering and
                                        slew rate control enabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <description>Disabled. The SDA0 pin has I2C glitch filtering and
                                        slew rate control disabled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SCLDRV0</name>
                            <description>Drive mode control for the SCL0 pin, P0.28.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>STANDARD</name>
                                    <description>Standard. The SCL0 pin is in the standard drive
                                        mode.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FAST_MODE_PLUS</name>
                                    <description>Fast-mode plus. The SCL0 pin is in Fast Mode Plus
                                        drive mode.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SCLI2C0</name>
                            <description>I 2C filter mode control for the SCL0 pin, P0.28.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <description>Enabled. The SCL0 pin has I2C glitch filtering and
                                        slew rate control enabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <description>Disabled. The SCL0 pin has I2C glitch filtering and
                                        slew rate control disabled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
