itzandroidtab/klib-svd/lpc1752.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CCAN</name>
            <description>Central CAN controller </description>
            <groupName>CCAN</groupName>
            <baseAddress>0x40040000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>CANActivity</name>
                <value>34</value>
            </interrupt>
            <registers>
                <register>
                    <name>TXSR</name>
                    <description>CAN Central Transmit Status Register</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-only</access>
                    <resetValue>0x00030300</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TS1</name>
                            <description>When 1, the CAN controller 1 is sending a message (same as
                                TS in the CAN1GSR).</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TS2</name>
                            <description>When 1, the CAN controller 2 is sending a message (same as
                                TS in the CAN2GSR)</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[7:2]</bitRange>
                        </field>
                        <field>
                            <name>TBS1</name>
                            <description>When 1, all 3 Tx Buffers of the CAN1 controller are
                                available to the CPU (same as TBS in CAN1GSR).</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>TBS2</name>
                            <description>When 1, all 3 Tx Buffers of the CAN2 controller are
                                available to the CPU (same as TBS in CAN2GSR).</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[15:10]</bitRange>
                        </field>
                        <field>
                            <name>TCS1</name>
                            <description>When 1, all requested transmissions have been completed
                                successfully by the CAN1 controller (same as TCS in CAN1GSR).</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>TCS2</name>
                            <description>When 1, all requested transmissions have been completed
                                successfully by the CAN2 controller (same as TCS in CAN2GSR).</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:18]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXSR</name>
                    <description>CAN Central Receive Status Register</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RS1</name>
                            <description>When 1, CAN1 is receiving a message (same as RS in
                                CAN1GSR).</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RS2</name>
                            <description>When 1, CAN2 is receiving a message (same as RS in
                                CAN2GSR).</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[7:2]</bitRange>
                        </field>
                        <field>
                            <name>RB1</name>
                            <description>When 1, a received message is available in the CAN1
                                controller (same as RBS in CAN1GSR).</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>RB2</name>
                            <description>When 1, a received message is available in the CAN2
                                controller (same as RBS in CAN2GSR).</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[15:10]</bitRange>
                        </field>
                        <field>
                            <name>DOS1</name>
                            <description>When 1, a message was lost because the preceding message to
                                CAN1 controller was not read out quickly enough (same as DOS in
                                CAN1GSR).</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>DOS2</name>
                            <description>When 1, a message was lost because the preceding message to
                                CAN2 controller was not read out quickly enough (same as DOS in
                                CAN2GSR).</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:18]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSR</name>
                    <description>CAN Central Miscellaneous Register</description>
                    <addressOffset>0x008</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>E1</name>
                            <description>When 1, one or both of the CAN1 Tx and Rx Error Counters
                                has reached the limit set in the CAN1EWL register (same as ES in
                                CAN1GSR)</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>E2</name>
                            <description>When 1, one or both of the CAN2 Tx and Rx Error Counters
                                has reached the limit set in the CAN2EWL register (same as ES in
                                CAN2GSR)</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[7:2]</bitRange>
                        </field>
                        <field>
                            <name>BS1</name>
                            <description>When 1, the CAN1 controller is currently involved in bus
                                activities (same as BS in CAN1GSR).</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>BS2</name>
                            <description>When 1, the CAN2 controller is currently involved in bus
                                activities (same as BS in CAN2GSR).</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
