itzandroidtab/klib-svd/lpc1752.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="CAN1">
            <name>CAN2</name>
            <baseAddress>0x40048000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="I2C0">
            <name>I2C1</name>
            <baseAddress>0x4005C000</baseAddress>
            <interrupt>
                <name>I2C1</name>
                <value>11</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="SSP0">
            <name>SSP1</name>
            <description>SSP controller</description>
            <groupName>SSP</groupName>
            <baseAddress>0x40030000</baseAddress>
            <interrupt>
                <name>SSP1</name>
                <value>15</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>DAC</name>
            <description> Digital-to-Analog Converter (DAC) </description>
            <groupName>DAC</groupName>
            <baseAddress>0x4008C000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CR</name>
                    <description>D/A Converter Register. This register contains the digital value to
                        be converted to analog and a power control bit.</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[5:0]</bitRange>
                        </field>
                        <field>
                            <name>VALUE</name>
                            <description>After the selected settling time after this field is
                                written with a new VALUE, the voltage on the DAC_OUT pin (with
                                respect to VSSA) is VALUE x ((VREFP - V REFN)/1024) + VREFN.</description>
                            <bitRange>[15:6]</bitRange>
                        </field>
                        <field>
                            <name>BIAS</name>
                            <description>Settling time The settling times noted in the description
                                of the BIAS bit are valid for a capacitance load on the DAC_OUT pin
                                not exceeding 100 pF. A load impedance value greater than that value
                                will cause settling time longer than the specified time. One or more
                                graphs of load impedance vs. settling time will be included in the
                                final data sheet.</description>
                            <bitRange>[16:16]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>FAST</name>
                                    <description>The settling time of the DAC is 1 us max, and the
                                        maximum current is 700 uA. This allows a maximum update rate
                                        of 1 MHz.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SLOW</name>
                                    <description>The settling time of the DAC is 2.5 us and the
                                        maximum current is 350 uA. This allows a maximum update rate
                                        of 400 kHz.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:17]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL</name>
                    <description>DAC Control register. This register controls DMA and timer
                        operation.</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INT_DMA_REQ</name>
                            <description>DMA interrupt request</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CLEAR_ON_ANY_WRITE_T</name>
                                    <description>Clear on any write to the DACR register.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SET_BY_HARDWARE_WHEN</name>
                                    <description>Set by hardware when the timer times out.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DBLBUF_ENA</name>
                            <description>Double buffering</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_WHEN_THIS_BI</name>
                                    <description>Enable. When this bit and the CNT_ENA bit are both
                                        set, the double-buffering feature in the DACR register will
                                        be enabled. Writes to the DACR register are written to a
                                        pre-buffer and then transferred to the DACR on the next
                                        time-out of the counter.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CNT_ENA</name>
                            <description>Time-out counter operation</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>Enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMA_ENA</name>
                            <description>DMA access</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>Disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_DMA_BURST_RE</name>
                                    <description>Enable. DMA Burst Request Input 7 is enabled for
                                        the DAC (see Table 672).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNTVAL</name>
                    <description>DAC Counter Value register. This register contains the reload value
                        for the DAC DMA/Interrupt timer.</description>
                    <addressOffset>0x008</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VALUE</name>
                            <description>16-bit reload value for the DAC interrupt/DMA timer.</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
