itzandroidtab/klib-svd/lpc1752.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RITIMER</name>
            <description>Repetitive Interrupt Timer (RIT) </description>
            <groupName>RIT</groupName>
            <baseAddress>0x400B0000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RIT</name>
                <value>29</value>
            </interrupt>
            <registers>
                <register>
                    <name>COMPVAL</name>
                    <description>Compare register</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RICOMP</name>
                            <description>Compare register. Holds the compare value which is compared
                                to the counter.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MASK</name>
                    <description>Mask register. This register holds the 32-bit mask value. A 1
                        written to any bit will force a compare on the corresponding bit of the
                        counter and compare register.</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RIMASK</name>
                            <description>Mask register. This register holds the 32-bit mask value. A
                                one written to any bit overrides the result of the comparison for
                                the corresponding bit of the counter and compare register (causes
                                the comparison of the register bits to be always true).</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL</name>
                    <description>Control register.</description>
                    <addressOffset>0x008</addressOffset>
                    <access>read-write</access>
                    <resetValue>0xC</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RITINT</name>
                            <description>Interrupt flag</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THIS_BIT_IS_SET_TO_1</name>
                                    <description>This bit is set to 1 by hardware whenever the
                                        counter value equals the masked compare value specified by
                                        the contents of RICOMPVAL and RIMASK registers. Writing a 1
                                        to this bit will clear it to 0. Writing a 0 has no effect.</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_COUNTER_VALUE_DO</name>
                                    <description>The counter value does not equal the masked compare
                                        value.</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RITENCLR</name>
                            <description>Timer enable clear</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THE_TIMER_WILL_BE_CL</name>
                                    <description>The timer will be cleared to 0 whenever the counter
                                        value equals the masked compare value specified by the
                                        contents of RICOMPVAL and RIMASK registers. This will occur
                                        on the same clock that sets the interrupt flag.</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_TIMER_WILL_NOT_B</name>
                                    <description>The timer will not be cleared to 0.</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RITENBR</name>
                            <description>Timer enable for debug</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THE_TIMER_IS_HALTED_</name>
                                    <description>The timer is halted when the processor is halted
                                        for debugging.</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DEBUG_HAS_NO_EFFECT_</name>
                                    <description>Debug has no effect on the timer operation.</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RITEN</name>
                            <description>Timer enable.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>TIMER_ENABLED_THIS_</name>
                                    <description>Timer enabled. This can be overruled by a debug
                                        halt if enabled in bit 2.</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIMER_DISABLED_</name>
                                    <description>Timer disabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COUNTER</name>
                    <description>32-bit counter</description>
                    <addressOffset>0x00C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RICOUNTER</name>
                            <description>32-bit up counter. Counts continuously unless RITEN bit in
                                RICTRL register is cleared or debug mode is entered (if enabled by
                                the RITNEBR bit in RICTRL). Can be loaded to any value in software.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
