itzandroidtab/klib-svd/lpc1752.svd
                <register>
                    <name>INTF_SET</name>
                    <description>Interrupt flags set address</description>
                    <addressOffset>0x06C</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>ILIM0_F_SET</name>
                            <description>Writing a one sets the corresponding bit in the INTF
                                register, thus possibly simulating hardware interrupt.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>IMAT0_F_SET</name>
                            <description>Writing a one sets the corresponding bit in the INTF
                                register, thus possibly simulating hardware interrupt.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>ICAP0_F_SET</name>
                            <description>Writing a one sets the corresponding bit in the INTF
                                register, thus possibly simulating hardware interrupt.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>ILIM1_F_SET</name>
                            <description>Writing a one sets the corresponding bit in the INTF
                                register, thus possibly simulating hardware interrupt.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>IMAT1_F_SET</name>
                            <description>Writing a one sets the corresponding bit in the INTF
                                register, thus possibly simulating hardware interrupt.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>ICAP1_F_SET</name>
                            <description>Writing a one sets the corresponding bit in the INTF
                                register, thus possibly simulating hardware interrupt.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>ILIM2_F_SET</name>
                            <description>Writing a one sets the corresponding bit in the INTF
                                register, thus possibly simulating hardware interrupt.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>IMAT2_F_SET</name>
                            <description>Writing a one sets the corresponding bit in the INTF
                                register, thus possibly simulating hardware interrupt.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>ICAP2_F_SET</name>
                            <description>Writing a one sets the corresponding bit in the INTF
                                register, thus possibly simulating hardware interrupt.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[14:11]</bitRange>
                        </field>
                        <field>
                            <name>ABORT_F_SET</name>
                            <description>Writing a one sets the corresponding bit in the INTF
                                register, thus possibly simulating hardware interrupt.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTF_CLR</name>
                    <description>Interrupt flags clear address</description>
                    <addressOffset>0x070</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>ILIM0_F_CLR</name>
                            <description>Writing a one clears the corresponding bit in the INTF
                                register, thus clearing the corresponding interrupt request.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>IMAT0_F_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>ICAP0_F_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>ILIM1_F_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>IMAT1_F_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>ICAP1_F_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>ILIM2_F_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>IMAT2_F_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>ICAP2_F_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[14:11]</bitRange>
                        </field>
                        <field>
                            <name>ABORT_F_CLR</name>
                            <description>Writing a one clears the corresponding bit in INTEN, thus
                                disabling the interrupt.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
