itzandroidtab/klib-svd/lpc1752.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>QEI</name>
            <description>Quadrature Encoder Interface (QEI) </description>
            <groupName>QEI</groupName>
            <baseAddress>0x400BC000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>QEI</name>
                <value>31</value>
            </interrupt>
            <registers>
                <register>
                    <name>CON</name>
                    <description>Control register</description>
                    <addressOffset>0x000</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>RESP</name>
                            <description>Reset position counter. When set = 1, resets the position
                                counter to all zeros. Autoclears when the position counter is
                                cleared.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RESPI</name>
                            <description>Reset position counter on index. When set = 1, resets the
                                position counter to all zeros once only the first time an index
                                pulse occurs. Autoclears when the position counter is cleared.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RESV</name>
                            <description>Reset velocity. When set = 1, resets the velocity counter
                                to all zeros, reloads the velocity timer, and presets the velocity
                                compare register. Autoclears when the velocity counter is cleared.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RESI</name>
                            <description>Reset index counter. When set = 1, resets the index counter
                                to all zeros. Autoclears when the index counter is cleared.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CONF</name>
                    <description>Configuration register</description>
                    <addressOffset>0x008</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DIRINV</name>
                            <description>Direction invert. When 1, complements the DIR bit.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>SIGMODE</name>
                            <description>Signal Mode. When 0, PhA and PhB function as quadrature
                                encoder inputs. When 1, PhA functions as the direction signal and
                                PhB functions as the clock signal.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>CAPMODE</name>
                            <description>Capture Mode. When 0, only PhA edges are counted (2X). When
                                1, BOTH PhA and PhB edges are counted (4X), increasing resolution
                                but decreasing range.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>INVINX</name>
                            <description>Invert Index. When 1, inverts the sense of the index input.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>CRESPI</name>
                            <description>Continuously reset the position counter on index. When 1,
                                resets the position counter to all zeros whenever an index pulse
                                occurs after the next position increase (recalibration).</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[15:5]</bitRange>
                        </field>
                        <field>
                            <name>INXGATE</name>
                            <description>Index gating configuration: When INXGATE[16] = 1, pass the
                                index when PHA = 1 and PHB = 0, otherwise block index. When
                                INXGATE[17] = 1, pass the index when PHA = 1 and PHB = 1, otherwise
                                block index. When INXGATE[18] = 1, pass the index when PHA = 0 and
                                PHB = 1, otherwise block index. When INXGATE[19] = 1, pass the index
                                when PHA = 0 and PHB = 0, otherwise block index.</description>
                            <bitRange>[19:16]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:20]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <description>Status register</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DIR</name>
                            <description>Direction bit. In combination with DIRINV bit indicates
                                forward or reverse direction. See Table 597.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:1]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POS</name>
                    <description>Position register</description>
                    <addressOffset>0x00C</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POS</name>
                            <description>Current position value.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MAXPOS</name>
                    <description>Maximum position register</description>
                    <addressOffset>0x010</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MAXPOS</name>
                            <description>Current maximum position value.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMPOS0</name>
                    <description>Position compare register 0</description>
                    <addressOffset>0x014</addressOffset>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PCMP0</name>
                            <description>Position compare value 0.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMPOS1</name>
                    <description>Position compare register 1</description>
                    <addressOffset>0x018</addressOffset>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PCMP1</name>
                            <description>Position compare value 1.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMPOS2</name>
                    <description>Position compare register 2</description>
                    <addressOffset>0x01C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PCMP2</name>
                            <description>Position compare value 2.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INXCNT</name>
                    <description>Index count register 0</description>
                    <addressOffset>0x020</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ENCPOS</name>
                            <description>Current index counter value.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INXCMP0</name>
                    <description>Index compare register 0</description>
                    <addressOffset>0x024</addressOffset>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ICMP0</name>
                            <description>Index compare value 0.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LOAD</name>
                    <description>Velocity timer reload register</description>
                    <addressOffset>0x028</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VELLOAD</name>
                            <description>Current velocity timer load value.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIME</name>
                    <description>Velocity timer register</description>
                    <addressOffset>0x02C</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VELVAL</name>
                            <description>Current velocity timer value.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VEL</name>
                    <description>Velocity counter register</description>
                    <addressOffset>0x030</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VELPC</name>
                            <description>Current velocity pulse count.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAP</name>
                    <description>Velocity capture register</description>
                    <addressOffset>0x034</addressOffset>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VELCAP</name>
                            <description>Last velocity capture.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VELCOMP</name>
                    <description>Velocity compare register</description>
                    <addressOffset>0x038</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VELPC</name>
                            <description>Compare velocity pulse count.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FILTER</name>
                    <description>Digital filter register</description>
                    <addressOffset>0x03C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FILTA</name>
                            <description>Digital filter sampling delay.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTSTAT</name>
                    <description>Interrupt status register</description>
                    <addressOffset>0xFE0</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INX_INT</name>
                            <description>Indicates that an index pulse was detected.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TIM_INT</name>
                            <description>Indicates that a velocity timer overflow occurred</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>VELC_INT</name>
                            <description>Indicates that captured velocity is less than compare
                                velocity.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>DIR_INT</name>
                            <description>Indicates that a change of direction was detected.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>ERR_INT</name>
                            <description>Indicates that an encoder phase error was detected.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>ENCLK_INT</name>
                            <description>Indicates that and encoder clock pulse was detected.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>POS0_INT</name>
                            <description>Indicates that the position 0 compare value is equal to the
                                current position.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>POS1_INT</name>
                            <description>Indicates that the position 1compare value is equal to the
                                current position.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>POS2_INT</name>
                            <description>Indicates that the position 2 compare value is equal to the
                                current position.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>REV0_INT</name>
                            <description>Indicates that the index compare 0 value is equal to the
                                current index count.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>POS0REV_INT</name>
                            <description>Combined position 0 and revolution count interrupt. Set
                                when both the POS0_Int bit is set and the REV0_Int is set.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>POS1REV_INT</name>
                            <description>Combined position 1 and revolution count interrupt. Set
                                when both the POS1_Int bit is set and the REV1_Int is set.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>POS2REV_INT</name>
                            <description>Combined position 2 and revolution count interrupt. Set
                                when both the POS2_Int bit is set and the REV2_Int is set.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>REV1_INT</name>
                            <description>Indicates that the index compare 1value is equal to the
                                current index count.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>REV2_INT</name>
                            <description>Indicates that the index compare 2 value is equal to the
                                current index count.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>MAXPOS_INT</name>
                            <description>Indicates that the current position count goes through the
                                MAXPOS value to zero in the forward direction, or through zero to
                                MAXPOS in the reverse direction.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
