itzandroidtab/klib-svd/lpc1752.svd
                <register>
                    <name>INTENABLE</name>
                    <description>Interrupt enable register.</description>
                    <addressOffset>0xFE4</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RXOVERRUNINTEN</name>
                            <description>Enable for interrupt trigger on receive buffer overrun or
                                descriptor underrun situations.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RXERRORINTEN</name>
                            <description>Enable for interrupt trigger on receive errors.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RXFINISHEDINTEN</name>
                            <description>Enable for interrupt triggered when all receive descriptors
                                have been processed i.e. on the transition to the situation where
                                ProduceIndex == ConsumeIndex.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RXDONEINTEN</name>
                            <description>Enable for interrupt triggered when a receive descriptor
                                has been processed while the Interrupt bit in the Control field of
                                the descriptor was set.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>TXUNDERRUNINTEN</name>
                            <description>Enable for interrupt trigger on transmit buffer or
                                descriptor underrun situations.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>TXERRORINTEN</name>
                            <description>Enable for interrupt trigger on transmit errors.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>TXFINISHEDINTEN</name>
                            <description>Enable for interrupt triggered when all transmit
                                descriptors have been processed i.e. on the transition to the
                                situation where ProduceIndex == ConsumeIndex.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>TXDONEINTEN</name>
                            <description>Enable for interrupt triggered when a descriptor has been
                                transmitted while the Interrupt bit in the Control field of the
                                descriptor was set.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>SOFTINTEN</name>
                            <description>Enable for interrupt triggered by the SoftInt bit in the
                                IntStatus register, caused by software writing a 1 to the SoftIntSet
                                bit in the IntSet register.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>WAKEUPINTEN</name>
                            <description>Enable for interrupt triggered by a Wake-up event detected
                                by the receive filter.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[31:14]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTCLEAR</name>
                    <description>Interrupt clear register.</description>
                    <addressOffset>0xFE8</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RXOVERRUNINTCLR</name>
                            <description>Writing a 1 clears the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RXERRORINTCLR</name>
                            <description>Writing a 1 clears the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RXFINISHEDINTCLR</name>
                            <description>Writing a 1 clears the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RXDONEINTCLR</name>
                            <description>Writing a 1 clears the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>TXUNDERRUNINTCLR</name>
                            <description>Writing a 1 clears the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>TXERRORINTCLR</name>
                            <description>Writing a 1 clears the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>TXFINISHEDINTCLR</name>
                            <description>Writing a 1 clears the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>TXDONEINTCLR</name>
                            <description>Writing a 1 clears the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>SOFTINTCLR</name>
                            <description>Writing a 1 clears the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>WAKEUPINTCLR</name>
                            <description>Writing a 1 clears the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[31:14]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTSET</name>
                    <description>Interrupt set register.</description>
                    <addressOffset>0xFEC</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RXOVERRUNINTSET</name>
                            <description>Writing a 1 to one sets the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RXERRORINTSET</name>
                            <description>Writing a 1 to one sets the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RXFINISHEDINTSET</name>
                            <description>Writing a 1 to one sets the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RXDONEINTSET</name>
                            <description>Writing a 1 to one sets the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>TXUNDERRUNINTSET</name>
                            <description>Writing a 1 to one sets the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>TXERRORINTSET</name>
                            <description>Writing a 1 to one sets the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>TXFINISHEDINTSET</name>
                            <description>Writing a 1 to one sets the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>TXDONEINTSET</name>
                            <description>Writing a 1 to one sets the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>SOFTINTSET</name>
                            <description>Writing a 1 to one sets the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>WAKEUPINTSET</name>
                            <description>Writing a 1 to one sets the corresponding status bit in
                                interrupt status register IntStatus.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[31:14]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POWERDOWN</name>
                    <description>Power-down register.</description>
                    <addressOffset>0xFF4</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[30:0]</bitRange>
                        </field>
                        <field>
                            <name>PD</name>
                            <description>PowerDownMACAHB. If true, all AHB accesses will return a
                                read/write error, except accesses to the Power-Down register.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
