itzandroidtab/klib-svd/lpc1752.svd
                <register>
                    <name>EPINTSET</name>
                    <description>USB Endpoint Interrupt Set</description>
                    <addressOffset>0x23C</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EPSET0</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EPSET1</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EPSET2</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>EPSET3</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>EPSET4</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>EPSET5</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>EPSET6</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>EPSET7</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>EPSET8</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>EPSET9</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>EPSET10</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>EPSET11</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>EPSET12</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>EPSET13</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>EPSET14</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>EPSET15</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>EPSET16</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>EPSET17</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>EPSET18</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>EPSET19</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>EPSET20</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>EPSET21</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>EPSET22</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>EPSET23</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>EPSET24</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>EPSET25</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>EPSET26</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>EPSET27</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>EPSET28</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>EPSET29</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>EPSET30</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>EPSET31</name>
                            <description>0 = No effect. 1 = Sets the corresponding bit in
                                USBEpIntSt.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
