itzandroidtab/klib-svd/lpc1752.svd
                <register>
                    <name>I2C_CTL</name>
                    <description>I2C Control</description>
                    <addressOffset>0x308</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDIE</name>
                            <description>Transmit Done Interrupt Enable. This enables the TDI
                                interrupt signalling that this I2C issued a STOP condition.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_TDI_INTE</name>
                                    <description>Disable the TDI interrupt.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_TDI_INTER</name>
                                    <description>Enable the TDI interrupt.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AFIE</name>
                            <description>Transmitter Arbitration Failure Interrupt Enable. This
                                enables the AFI interrupt which is asserted during transmission when
                                trying to set SDA high, but the bus is driven low by another device.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_AFI_</name>
                                    <description>Disable the AFI.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_AFI_</name>
                                    <description>Enable the AFI.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NAIE</name>
                            <description>Transmitter No Acknowledge Interrupt Enable. This enables
                                the NAI interrupt signalling that transmitted byte was not
                                acknowledged.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_NAI_</name>
                                    <description>Disable the NAI.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_NAI_</name>
                                    <description>Enable the NAI.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DRMIE</name>
                            <description>Master Transmitter Data Request Interrupt Enable. This
                                enables the DRMI interrupt which signals that the master transmitter
                                has run out of data, has not issued a STOP, and is holding the SCL
                                line low.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_DRMI_INT</name>
                                    <description>Disable the DRMI interrupt.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_DRMI_INTE</name>
                                    <description>Enable the DRMI interrupt.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DRSIE</name>
                            <description>Slave Transmitter Data Request Interrupt Enable. This
                                enables the DRSI interrupt which signals that the slave transmitter
                                has run out of data and the last byte was acknowledged, so the SCL
                                line is being held low.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_DRSI_INT</name>
                                    <description>Disable the DRSI interrupt.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_DRSI_INTE</name>
                                    <description>Enable the DRSI interrupt.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>REFIE</name>
                            <description>Receive FIFO Full Interrupt Enable. This enables the
                                Receive FIFO Full interrupt to indicate that the receive FIFO cannot
                                accept any more data.</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_RFFI_</name>
                                    <description>Disable the RFFI.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_RFFI_</name>
                                    <description>Enable the RFFI.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RFDAIE</name>
                            <description>Receive Data Available Interrupt Enable. This enables the
                                DAI interrupt to indicate that data is available in the receive FIFO
                                (i.e. not empty).</description>
                            <bitRange>[6:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_DAI_</name>
                                    <description>Disable the DAI.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_DAI_</name>
                                    <description>Enable the DAI.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TFFIE</name>
                            <description>Transmit FIFO Not Full Interrupt Enable. This enables the
                                Transmit FIFO Not Full interrupt to indicate that the more data can
                                be written to the transmit FIFO. Note that this is not full. It is
                                intended help the CPU to write to the I2C block only when there is
                                room in the FIFO and do this without polling the status register.</description>
                            <bitRange>[7:7]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_TFFI_</name>
                                    <description>Disable the TFFI.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_TFFI_</name>
                                    <description>Enable the TFFI.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SRST</name>
                            <description>Soft reset. This is only needed in unusual circumstances.
                                If a device issues a start condition without issuing a stop
                                condition. A system timer may be used to reset the I2C if the bus
                                remains busy longer than the time-out period. On a soft reset, the
                                Tx and Rx FIFOs are flushed, I2C_STS register is cleared, and all
                                internal state machines are reset to appear idle. The I2C_CLKHI,
                                I2C_CLKLO and I2C_CTL (except Soft Reset Bit) are NOT modified by a
                                soft reset.</description>
                            <bitRange>[8:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_RESET</name>
                                    <description>No reset.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESET</name>
                                    <description>Reset the I2C to idle state. Self clearing.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:9]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2C_CLKHI</name>
                    <description>I2C Clock High</description>
                    <addressOffset>0x30C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0xB9</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CDHI</name>
                            <description>Clock divisor high. This value is the number of 48 MHz
                                clocks the serial clock (SCL) will be high.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2C_CLKLO</name>
                    <description>I2C Clock Low</description>
                    <addressOffset>0x310</addressOffset>
                    <access>write-only</access>
                    <resetValue>0xB9</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CDLO</name>
                            <description>Clock divisor low. This value is the number of 48 MHz
                                clocks the serial clock (SCL) will be low.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBCLKCTRL</name>
                    <description>USB Clock Control</description>
                    <addressOffset>0xFF4</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>DEV_CLK_EN</name>
                            <description>Device clock enable. Enables the usbclk input to the device
                                controller</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PORTSEL_CLK_EN</name>
                            <description>Port select register clock enable.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>AHB_CLK_EN</name>
                            <description>AHB clock enable</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OTGCLKCTRL</name>
                    <description>OTG clock controller</description>
                    <alternateRegister>USBCLKCTRL</alternateRegister>
                    <addressOffset>0xFF4</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HOST_CLK_EN</name>
                            <description>Host clock enable</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_HOST_CLO</name>
                                    <description>Disable the Host clock.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_HOST_CLOC</name>
                                    <description>Enable the Host clock.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DEV_CLK_EN</name>
                            <description>Device clock enable</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_DEVICE_C</name>
                                    <description>Disable the Device clock.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_DEVICE_CL</name>
                                    <description>Enable the Device clock.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>I2C_CLK_EN</name>
                            <description>I2C clock enable</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_I2C_CLOC</name>
                                    <description>Disable the I2C clock.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_I2C_CLOCK</name>
                                    <description>Enable the I2C clock.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OTG_CLK_EN</name>
                            <description>OTG clock enable. In device-only applications, this bit
                                enables access to the PORTSEL register.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_OTG_CLOC</name>
                                    <description>Disable the OTG clock.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_OTG_CLOCK</name>
                                    <description>Enable the OTG clock.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AHB_CLK_EN</name>
                            <description>AHB master clock enable</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_AHB_CLOC</name>
                                    <description>Disable the AHB clock.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_AHB_CLOCK</name>
                                    <description>Enable the AHB clock.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
