itzandroidtab/klib-svd/lpc1752.svd
                <register>
                    <name>CLR</name>
                    <description>Port Output Clear register using FIOMASK.</description>
                    <addressOffset>0x01C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PINCLR0</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR1</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR2</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR3</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR4</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR5</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR6</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR7</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR8</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR9</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR10</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR11</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR12</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR13</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR14</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR15</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR16</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR17</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR18</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR19</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR20</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR21</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR22</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR23</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR24</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR25</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR26</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR27</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR28</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR29</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR30</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>PINCLR31</name>
                            <description>Fast GPIO output value Clear bits. Bit 0 in CLRx controls
                                pin Px[0], bit 31 in CLRx controls pin Px[31]. 0 = Controlled pin
                                output is unchanged. 1 = Controlled pin output is set to LOW.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="GPIO0">
            <name>GPIO1</name>
            <baseAddress>0x2009C020</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIO0">
            <name>GPIO2</name>
            <baseAddress>0x2009C040</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIO0">
            <name>GPIO3</name>
            <baseAddress>0x2009C060</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIO0">
            <name>GPIO4</name>
            <baseAddress>0x2009C080</baseAddress>
        </peripheral>
    </peripherals>
</device>